Tekla.Structures.Datatype.IIntDataType
The IIntDataType interface is an interface for the Tekla.Structures.Datatype.*
types whose value is an integer.

Tekla.Structures.Datatype.IIntDataType.Value
The integer value of the field.